{
  "title": "Unbroken",
  "genres": "Biography",
  "source": "http://www.imdb.com/title/tt1809398/reviews?ref_=tt_ov_rt",
  "score": "2/10",
  "helpfulness": "53/74",
  "author": "Wojtek",
  "body": "!May contain Spoilers! This movie does little beyond telling the story of Louis Zamperini - and it does so with a lot of missing details, no character growth, and contains little else than drawn out scenes of suffering. The movie is very similar to The Passion of the Christ in that the film shows little progression except when the main character is shown suffering in some way. The characters shown in the movie, Louis and \"The Bird\" being chief among them, have little to no backgrounds, motivations, or growth / story arcs. Louis is shown first as a troublesome child, then a youth learning to run, then an Olympian, and finally a soldier; between these scenes, however, there is no transition, no story about him deciding to go for the Olympics, and no story on whether he was drafted or voluntarily signed up to be a soldier. This results in the movie being very oddly paced and Louis having little substance to his background. Louis, while suffering in the Japanese prison camp, is never shown thinking \"I can't do this\" or progressing to the point that he determines \"I will make it out alive no matter what.\" He is simply tortured, repeatedly beaten and humiliated, and finally the war simply ends. Strangely enough, no other prisoners or \"extras\" are shown being killed / executed at the camp, which does little to help show the brutality of their conditions. Finally, the movie ends with written paragraphs on-screen which detail his life back in the US and how he forgave his captors. One of the biggest rules of film is to \"show them, not tell them,\" and considering that the written part of the story at the end contains more interesting parts of his life than most the movie, it seems the film was barely able to \"show us\" as well. The source material for the movie; Louis's story, is extraordinary and exciting, its unfortunate that the movie does very little to give it justice. ",
  "annotated_sentences": [
    {
      "text": "!May contain Spoilers!",
      "aspects": {
      },
      "comment": "ignore"
    },
    {
      "text": "This movie does little beyond telling the story of Louis Zamperini - and it does so with a lot of missing details, no character growth, and contains little else than drawn out scenes of suffering.",
      "aspects": {
        "movie": {
          "words": [
            "This movie"
          ],
          "score": "-1",
          "justification": "little beyond, little else, drawn out"
        },
        "plot": {
          "words": [
            "story",
            "character"
          ],
          "score": "-1",
          "justification": "no character growth"
        },
        "credibility": {
          "words": [
            "missing details"
          ],
          "score": "-1",
          "justification": "missing details"
        },
        "length": {
          "words": [
            "drawn out"
          ],
          "score": "-1",
          "justification": "drawn out"
        }
      },
      "comment": "very difficult, but possible to achieve"
    },
    {
      "text": "The movie is very similar to The Passion of the Christ in that the film shows little progression except when the main character is shown suffering in some way. The characters shown in the movie, Louis and \"The Bird\" being chief among them, have little to no backgrounds, motivations, or growth / story arcs.",
      "aspects": {
        "plot": {
          "words": [
            "story",
            "characters",
            "character"
          ],
          "score": "-1",
          "justification": "have little to no background, motivations, or growth / story arcs"
        }
      },
      "comment": "difficult, split?"
    },
    {
      "text": "Louis is shown first as a troublesome child, then a youth learning to run, then an Olympian, and finally a soldier; between these scenes, however, there is no transition, no story about him deciding to go for the Olympics, and no story on whether he was drafted or voluntarily signed up to be a soldier.",
      "aspects": {
        "plot": {
          "words": [
            "no story"
          ],
          "score": "-2",
          "justification": "no story"
        }
      },
      "comment": "next to impossible at this stage, the movie is missing crucial details, this is isn't feasible."
    },
    {
      "text": "This results in the movie being very oddly paced and Louis having little substance to his background.",
      "aspects": {
        "plot": {
          "words": [
            "paced"
          ],
          "score": "-1",
          "justification": "oddly paced"
        }
      },
      "comment": "ditto"
    },
    {
      "text": "Louis, while suffering in the Japanese prison camp, is never shown thinking \"I can't do this\" or progressing to the point that he determines \"I will make it out alive no matter what.",
      "aspects": {
      },
      "comment": "ignore"
    },
    {
      "text": "\" He is simply tortured, repeatedly beaten and humiliated, and finally the war simply ends.",
      "aspects": {
      },
      "comment": "ignore"
    },
    {
      "text": "Strangely enough, no other prisoners or \"extras\" are shown being killed / executed at the camp, which does little to help show the brutality of their conditions.",
      "aspects": {
      },
      "comment": "ignore"
    },
    {
      "text": "Finally, the movie ends with written paragraphs on-screen which detail his life back in the US and how he forgave his captors.",
      "aspects": {
      },
      "comment": "ignore"
    },
    {
      "text": "One of the biggest rules of film is to \"show them, not tell them,\" and considering that the written part of the story at the end contains more interesting parts of his life than most the movie, it seems the film was barely able to \"show us\" as well.",
      "aspects": {
        "movie": {
          "words": [
            "the film"
          ],
          "score": "-1",
          "justification": "barely able to"
        }
      },
      "comment": "same problem - very difficult to find sentence semantics"
    },
    {
      "text": "The source material for the movie; Louis's story, is extraordinary and exciting, its unfortunate that the movie does very little to give it justice. ",
      "aspects": {
        "movie": {
          "words": [
            "the movie"
          ],
          "score": "-2",
          "justification": "unfortunate, does very little to give it justice"
        },
        "plot": {
          "words": [
            "story"
          ],
          "score": "2",
          "justification": "extraordinary and exciting"
        }
      },
      "comment": "think we can be forgiven for counting this as plot"
    }
  ],
  "overall": "-1",
  "comment": "another difficult review +1"
}
