{
  "title": "12 years a slave",
  "genres": "Drama,History",
  "source": "imdb.com",
  "score": "10/10",
  "helpfulness": "196/301",
  "author": "Georgi",
  "body": "I attended the premiere of 12 Years a Slave at the Toronto International Film Festival. Having no tickets, we had to wait close to 4 hours hoping they might let us in. I have to say it was definitely worth the wait and it is hands down the best film I've seen at the festival.The film is based on the real story of Solomon Northup (played by Chiwetel Ejiofor), a free black man living in New York, who is abducted and sold into slavery in Louisiana. As the film begins, we are exposed to his talent as a musician (he plays the violin) and get a glimpse of the life he leads with his wife and two children. All is well until he meets two men who seem taken by his music and want to bring him along with them so he can play at various events. When Solomon wakes up in chains, his dark journey starts and the film never lets you take a break.If you've seen McQueen's other works then you more or less know what kind of movie to expect (if you haven't then please stop reading and watch Hunger and Shame). 12 Years a Slave is dark and raw, it exposes everything, without sugarcoating it. It is definitely hard to watch; Several people walked out of the the theatre but in my opinion, it is not only worth watching but necessary. Films exploring themes of slavery are few and far in between and never has one been quite as exhaustive and effective as this one. Beautifully shot and edited, the film features moments of tension, heartbreak and a few laughs here and there. Steve McQueen has created another masterpiece.Most actors get very little screen time. Paul Giamatti and Sarah Paulson are seen for a few minutes but both are great as usual. Benedict Cumberbatch plays a plantation owner, who recognizes Solomon's talent and tries to help him to a certain extent. Despite being a slaver, he is presented in the film as being a good man. Cumberbatch was very good, though outshined by far by Michael Fassbender. He goes through every emotion and gives it his everything. In my opinion, this is his best performance to date. Paul Dano gets a few minutes of screen time as well but makes incredible use of it. As Benedict's worker, he despises slaves and the songs he sings to Solomon makes an incredibly powerful scene, one of the most disturbing in the film. Lupita Nyong'o's first appearance in a feature film is stunning, as she plays a heart breaking young slave. I hope she has a long career ahead of her, she certainly has the talent for it. The true star is definitely Chiwetel Ejiofor. His performance as Solomon is stunning and unforgettable, I truly hope he wins the Oscar for it this year.All in all, if you get a chance to see 12 Years a Slave, don't miss it. Not everyone will be able to stomach it but it's an outstanding film that deserves and needs to be seen. .",
  "annotated_sentences": [
    {
      "text": "I attended the premiere of 12 Years a Slave at the Toronto International Film Festival.",
      "aspects": {
      },
      "comment": ""
    },
    {
      "text": "Having no tickets, we had to wait close to 4 hours hoping they might let us in.",
      "aspects": {
      },
      "comment": ""
    },
    {
      "text": "I have to say it was definitely worth the wait and it is hands down the best film I've seen at the festival.The film is based on the real story of Solomon Northup (played by Chiwetel Ejiofor), a free black man living in New York, who is abducted and sold into slavery in Louisiana.",
      "aspects": {
        "movie": {
          "words": [
            "film"
          ],
          "score": "2",
          "justification": "worth the wait,hands down the best film"
        }
      },
      "comment": ""
    },
    {
      "text": "As the film begins, we are exposed to his talent as a musician (he plays the violin) and get a glimpse of the life he leads with his wife and two children.",
      "aspects": {
      },
      "comment": "Retelling the story"
    },
    {
      "text": "All is well until he meets two men who seem taken by his music and want to bring him along with them so he can play at various events.",
      "aspects": {
      },
      "comment": ""
    },
    {
      "text": "When Solomon wakes up in chains, his dark journey starts and the film never lets you take a break.If you've seen McQueen's other works then you more or less know what kind of movie to expect (if you haven't then please stop reading and watch Hunger and Shame).",
      "aspects": {
        "movie": {
          "words": [
            "the film"
          ],
          "score": "1",
          "justification": "never let's you take a brake"
        }
      },
      "comment": ""
    },
    {
      "text": "12 Years a Slave is dark and raw, it exposes everything, without sugarcoating it.",
      "aspects": {
        "movie": {
          "words": [
            "12 Years a Slave"
          ],
          "score": "0",
          "justification": "dark and raw"
        }
      },
      "comment": "dark and raw are not positives,but not negatives here too"
    },
    {
      "text": "It is definitely hard to watch; Several people walked out of the the theatre but in my opinion, it is not only worth watching but necessary.",
      "aspects": {
        "movie": {
          "words": [
            "it"
          ],
          "score": "2",
          "justification": "worth watching,necessary"
        }
      },
      "comment": ""
    },
    {
      "text": "Films exploring themes of slavery are few and far in between and never has one been quite as exhaustive and effective as this one.",
      "aspects": {
        "movie": {
          "words": [
            "this one"
          ],
          "score": "2",
          "justification": "effective and exhaustive"
        }
      },
      "comment": ""
    },
    {
      "text": "Beautifully shot and edited, the film features moments of tension, heartbreak and a few laughs here and there.",
      "aspects": {
        "editing": {
          "words": [
            "edited"
          ],
          "score": "2",
          "justification": "beautifully shot and edited"
        }
      },
      "comment": ""
    },
    {
      "text": "Steve McQueen has created another masterpiece.Most actors get very little screen time.",
      "aspects": {
        "movie": {
          "words": [
            "masterpiece"
          ],
          "score": "2",
          "justification": "masterpiece"
        }
      },
      "comment": ""
    },
    {
      "text": "Paul Giamatti and Sarah Paulson are seen for a few minutes but both are great as usual.",
      "aspects": {
        "cast": {
          "words": [
            "Paul Giamatti and Sarah Paulson"
          ],
          "score": "2",
          "justification": "great as usual"
        }
      },
      "comment": ""
    },
    {
      "text": "Benedict Cumberbatch plays a plantation owner, who recognizes Solomon's talent and tries to help him to a certain extent.",
      "aspects": {
      },
      "comment": ""
    },
    {
      "text": "Despite being a slaver, he is presented in the film as being a good man.",
      "aspects": {
      },
      "comment": ""
    },
    {
      "text": "Cumberbatch was very good, though outshined by far by Michael Fassbender.",
      "aspects": {
        "cast": {
          "words": [
            "Cumberbatch"
          ],
          "score": "2",
          "justification": "very good,outshined"
        }
      },
      "comment": ""
    },
    {
      "text": "He goes through every emotion and gives it his everything.",
      "aspects": {
      },
      "comment": ""
    },
    {
      "text": "In my opinion, this is his best performance to date.",
      "aspects": {
        "cast": {
          "words": [
            "performance"
          ],
          "score": "2 ",
          "justification": "best performance"
        }
      },
      "comment": ""
    },
    {
      "text": "Paul Dano gets a few minutes of screen time as well but makes incredible use of it.",
      "aspects": {
        "cast": {
          "words": [
            "Paul Dano"
          ],
          "score": "2",
          "justification": "incredible use of it"
        }
      },
      "comment": ""
    },
    {
      "text": "As Benedict's worker, he despises slaves and the songs he sings to Solomon makes an incredibly powerful scene, one of the most disturbing in the film.",
      "aspects": {
      },
      "comment": ""
    },
    {
      "text": "Lupita Nyong'o's first appearance in a feature film is stunning, as she plays a heart breaking young slave.",
      "aspects": {
        "cast": {
          "words": [
            "Lupita"
          ],
          "score": "2",
          "justification": "stunning"
        }
      },
      "comment": ""
    },
    {
      "text": "I hope she has a long career ahead of her, she certainly has the talent for it.",
      "aspects": {
      },
      "comment": ""
    },
    {
      "text": "The true star is definitely Chiwetel Ejiofor.",
      "aspects": {
        "cast": {
          "words": [
            "Chiwetel"
          ],
          "score": "2",
          "justification": "true star"
        }
      },
      "comment": ""
    },
    {
      "text": "His performance as Solomon is stunning and unforgettable, I truly hope he wins the Oscar for it this year.All in all, if you get a chance to see 12 Years a Slave, don't miss it.",
      "aspects": {
        "movie": {
          "words": [
            "12 years a slave"
          ],
          "score": "2",
          "justification": "don't miss it"
        },
        "cast": {
          "words": [
            "performance"
          ],
          "score": "2",
          "justification": "stunning and unforgetable"
        }
      },
      "comment": ""
    },
    {
      "text": "Not everyone will be able to stomach it but it's an outstanding film that deserves and needs to be seen.",
      "aspects": {
        "movie": {
          "words": [
            "film"
          ],
          "score": "2",
          "justification": "outstanding"
        }
      },
      "comment": ""
    },
    {
      "text": ".",
      "aspects": {
      },
      "comment": ""
    }
  ],
  "overall": "2",
  "comment": ""
}