{
  "title": "Fifty Shades of Grey",
  "genres": " Drama, Romance",
  "source": "http://www.imdb.com/title/tt2322441/reviews",
  "score": "1/10",
  "helpfulness": "2120/2651",
  "author": "Kestutis Sidlauskas",
  "body": "Keep in mind that I've read the book. The writing is laughable and sophomoric. It's the literary version of redtube. If you pay close attention, you'll realize that it's Twilight fan fiction. I'm sorry, women are idiots (NOT ALL OF THEM). Only women would read an erotic novel and think it's an excellent piece of romantic literature. I honestly felt like I was reading the playbill for a bad porno.Now, onto the film...The directing - Okay, I guess?The acting - Jamie Dorman's American accent... Just, terrible. I honestly thought Keanu Reeves had a better accent in Dracula. Dakota is good, but if you're a guy, you're probably going in just to see her get rammed.The script - Just like the book.What you'll actually go in for - A tit here, an ass there. Probably something you'd spend your time \"pleasuring\" yourself to.Of course, it's impossible to make a good movie adaption of a crap book. And I came on here today to see a 4.0? At least I'm not the only one. LolI would really like to see this fail hard, just to see the plan for two sequels get put on the shelf. But with the amount of fangirls with wet panties, this will probably end up passing the $1 billion mark...EDIT: I'm serious here, girls. You need to stop downvoting my review and making me feel bad about myself. Please, try to be more compassionate. As you may or may not know, I am of fragile ego, and any more little down-arrows could lead me into a serious depressive state of insomnia, suicidal thoughts, substance abuse, and obsessive masturbation. You have to be a little more considerate when you so brazenly downvote people's reviews, because, in a way, you're downvoting the people themselves.#Justice4EMODEDIT EDIT: I'm getting too many messages from puerile fangirls saying this edit makes me look immature. Please get an education, and when you do, come back here, and see how much of a fool you'd made of yourself because you took the edit seriously. ",
  "annotated_sentences": [
    {
      "text": "Keep in mind that I've read the book.",
      "aspects": {
      },
      "comment": ""
    },
    {
      "text": "The writing is laughable and sophomoric.",
      "aspects": {
      },
      "comment": ""
    },
    {
      "text": "It's the literary version of redtube.",
      "aspects": {
      },
      "comment": ""
    },
    {
      "text": "If you pay close attention, you'll realize that it's Twilight fan fiction.",
      "aspects": {
      },
      "comment": ""
    },
    {
      "text": "I'm sorry, women are idiots (NOT ALL OF THEM).",
      "aspects": {
      },
      "comment": ""
    },
    {
      "text": "Only women would read an erotic novel and think it's an excellent piece of romantic literature.",
      "aspects": {
      },
      "comment": ""
    },
    {
      "text": "I honestly felt like I was reading the playbill for a bad porno.Now, onto the film...The directing - Okay, I guess?The acting - Jamie Dorman's American accent... Just, terrible.",
      "aspects": {
        "cast": {
          "words": [
            "acting"
          ],
          "score": "-2",
          "justification": "terrible"
        }
      },
      "comment": ""
    },
    {
      "text": "I honestly thought Keanu Reeves had a better accent in Dracula.",
      "aspects": {
      },
      "comment": ""
    },
    {
      "text": "Dakota is good, but if you're a guy, you're probably going in just to see her get rammed.The script - Just like the book.What you'll actually go in for - A tit here, an ass there.",
      "aspects": {
        "cast": {
          "words": [
            "Dakota"
          ],
          "score": "1",
          "justification": "good"
        },
         "credibility": {
          "words": [
            "book"
          ],
          "score": "1",
          "justification": "just like"
        }
      },
      "comment": "isn't script about the plot generally? in this case only thing it gives us is credibility - neither good nor bad"
    },
    {
      "text": "Probably something you'd spend your time \"pleasuring\" yourself to.Of course, it's impossible to make a good movie adaption of a crap book.",
      "aspects": {
      },
      "comment": ""
    },
    {
      "text": "And I came on here today to see a 4.0?",
      "aspects": {
      },
      "comment": ""
    },
    {
      "text": "At least I'm not the only one.",
      "aspects": {
      },
      "comment": ""
    },
    {
      "text": "LolI would really like to see this fail hard, just to see the plan for two sequels get put on the shelf.",
      "aspects": {
        "movie": {
          "words": [
            "this"
          ],
          "score": "-2",
          "justification": "I would really like to see this fail hard"
        }
      },
      "comment": ""
    },
    {
      "text": "But with the amount of fangirls with wet panties, this will probably end up passing the $1 billion mark...EDIT: I'm serious here, girls.",
      "aspects": {
      },
      "comment": ""
    },
    {
      "text": "You need to stop downvoting my review and making me feel bad about myself.",
      "aspects": {
      },
      "comment": ""
    },
    {
      "text": "Please, try to be more compassionate.",
      "aspects": {
      },
      "comment": ""
    },
    {
      "text": "As you may or may not know, I am of fragile ego, and any more little down-arrows could lead me into a serious depressive state of insomnia, suicidal thoughts, substance abuse, and obsessive masturbation.",
      "aspects": {
      },
      "comment": ""
    },
    {
      "text": "You have to be a little more considerate when you so brazenly downvote people's reviews, because, in a way, you're downvoting the people themselves.#Justice4EMODEDIT EDIT: I'm getting too many messages from puerile fangirls saying this edit makes me look immature.",
      "aspects": {
      },
      "comment": ""
    },
    {
      "text": "Please get an education, and when you do, come back here, and see how much of a fool you'd made of yourself because you took the edit seriously. ",
      "aspects": {
      },
      "comment": ""
    }
  ],
  "overall": "",
  "comment": ""
}