{
  "title": "The Cabinet of Dr. Caligari",
  "genres": "Horror",
  "source": "http://thedissolve.com/reviews/1219-the-cabinet-of-dr-caligari/",
  "score": "45/50",
  "helpfulness": "-",
  "author": "Kestutis Sidlauskas",
  "body": " The 1920 thriller The Cabinet Of Dr. Caligari has become such a reference point for the cinema arm of the artistic movement known as German Expressionism that just about anybody who knows anything about movies has seen at least some of Caligari—even if it’s a few disconnected images in a film-studies class, or in a documentary. Director Robert Wiene and his team of set-designers and painters (led by production designers Hermann Warm, Walter Reimann, and Walter Röhrig) created something magnificently fake with Caligari. No one was trying to fool anyone with the obviously phony backdrops, the painted shadows on the walls, the flat prop trees, or the misshapen doors, windows, and walkways. The world of The Cabinet Of Dr. Caligari is meant to resemble the world of the stage and the contents of the characters’ minds—giving interior lives an exterior shape and theatrical form. Caligari wasn’t the only work of popular art being produced in this style in Germany at the time, but it was one of the most successful internationally, and continues to set a standard for go-for-broke visual flair.  It’s also one hell of a movie. The odd narrative lull aside, The Cabinet Of Dr. Caligari is both eerie and efficient. The film begins tantalizingly, with a young man named Francis (played by Friedrich Fehér) talking with a man on a bench, then pointing to a stupefied, shambling woman named Jane (Lil Dagover) and saying, “That’s my fiancée.” From there, the movie flashes back to tell Francis and Jane’s story. But the flashback doesn’t start right away. First, Wiene and cinematographer Willy Hameister iris in and out several times in succession, as Francis sets the scene for his bench-mate, talking about a mountain village and fateful carnival. The halting intro has a mesmerizing effect—apt for a film about a hypnotist.  Francis’ flashback tells of a man named Dr. Caligari (Werner Krauss), with a curious carnival act: He travels with a sleepwalker named Cesare (Conrad Veidt), whom Caligari claims is under his spell, and can both predict the future and read minds. When Cesare predicts that Francis’ friend Alan will die by dawn—and Alan does die, gruesomely—Francis and Jane do some snooping, to find out if Caligari and Cesare are connected to a string of local murders. But the closer they get to Caligari, the more they risk becoming another of his pawns, and the more they learn some unpleasant truths about the world they thought they knew.  Kino Classics’ new Blu-ray edition of The Cabinet Of Dr. Caligari contains a stunning new 4K restoration, with a choice of two excellent musical scores: one a richly orchestrated soundtrack performed by musicians from Freiburg’s University Of Music, and the other a moody piece by DJ Spooky. The cleaned-up picture of this new Caligari may be a revelation to anyone whose primary memories of the movie are of hazy, distorted old video transfers of battered prints. In 4K, the level of detail in the painted backgrounds is clearer, and more impressive. The Cabinet Of Dr. Caligari’s overtly unrealistic sets have the unexpected effect of making a nearly century-old film feel modern, because it so obviously isn’t a document of the past. Caligari illustrates something more eternal: about great manipulators, and the underlying anxiety that either society has gone mad, or we have.  One of the big reasons The Cabinet Of Dr. Caligari still seems so vital is because artists and theoreticians haven’t stopped being influenced by it. Critical studies like Siegfried Kracauer’s seminal film-studies book From Caligari To Hitler used Wiene’s movie and its contemporaries as a way to describe what happened in Europe and elsewhere in the 20th century. Horror films around the world—including Universal’s monster movies of the 1930s and 1940s—borrowed liberally from The Cabinet Of Dr. Caligari’s scenes of dark stalkers and desperate chases. And the crooked fingers of expressionism (in the design sense, if not the underlying philosophy) have touched even children’s books and cartoons, like the work of Dr. Seuss and Chuck Jones.  But it’s The Cabinet Of Dr. Caligari’s depiction of a reality within a reality—explained by a story within a story—that’s pervaded popular culture in ways that haven’t gotten as much attention as the movie’s funky props. Wiene and screenwriters Hans Janowitz and Carl Mayer reveal the power of a well-constructed “this explains everything” tale to govern what people believe, and how they behave. When the film’s villain walks down the street, flinching from the words “You must become Caligari” that literally appear in the air all around him, the visual effect is eye-catching. But it’s also symbolic, showing how strong words can compel.  ",
  "annotated_sentences": [
    {
      "text": " The 1920 thriller The Cabinet Of Dr. Caligari has become such a reference point for the cinema arm of the artistic movement known as German Expressionism that just about anybody who knows anything about movies has seen at least some of Caligari—even if it’s a few disconnected images in a film-studies class, or in a documentary.",
      "aspects": {
      },
      "comment": "nothing specifically positive or negative"
    },
    {
      "text": "Director Robert Wiene and his team of set-designers and painters (led by production designers Hermann Warm, Walter Reimann, and Walter Röhrig) created something magnificently fake with Caligari.",
      "aspects": {
        "movie": {
          "words": [
            "film-title"
          ],
          "score": "0",
          "justification": "magnificently(+1) fake(-1)"
        },
        "credibility": {
          "words": [
            "fake"
          ],
          "score": "-1",
          "justification": "fake"
        }
      },
      "comment": "one of those phrases that you wouldn't know how to react to if you didn't know he gave a 4.5/5. charlie: I'd say 0"
    },
    {
      "text": "No one was trying to fool anyone with the obviously phony backdrops, the painted shadows on the walls, the flat prop trees, or the misshapen doors, windows, and walkways.",
      "aspects": {
        "credibility": {
          "words": [
            "phony"
          ],
          "score": "-1",
          "justification": "phony, misshapen"
        }
      },
      "comment": ""
    },
    {
      "text": "The world of The Cabinet Of Dr. Caligari is meant to resemble the world of the stage and the contents of the characters’ minds—giving interior lives an exterior shape and theatrical form.",
      "aspects": {
      },
      "comment": "not enough sentiment in this sentence"
    },
    {
      "text": "Caligari wasn’t the only work of popular art being produced in this style in Germany at the time, but it was one of the most successful internationally, and continues to set a standard for go-for-broke visual flair.",
      "aspects": {
        "movie": {
          "words": [
            "Caligari"
          ],
          "score": "2",
          "justification": "most successful"
        },
        "vision": {
          "words": [
            "visual"
          ],
          "score": "1",
          "justification": "continues to set a standard, flair"
        }
      },
      "comment": "you take a more serious review and a few sentences in start to regret it. but gotta do it as well, don't I? charlie: appreciate the effort :)"
    },
    {
      "text": "It’s also one hell of a movie.",
      "aspects": {
        "movie": {
          "words": [
            "movie"
          ],
          "score": "2",
          "justification": "one hell of a"
        }
      },
      "comment": "a popular phrase, even though 'hell' would usually be negative"
    },
    {
      "text": "The odd narrative lull aside, The Cabinet Of Dr. Caligari is both eerie and efficient.",
      "aspects": {
        "movie": {
          "words": [
            "film-title"
          ],
          "score": "2",
          "justification": "eerie, efficient"
        }
      },
      "comment": "eerie is a positive thing for horror films"
    },
    {
      "text": "The film begins tantalizingly, with a young man named Francis (played by Friedrich Fehér) talking with a man on a bench, then pointing to a stupefied, shambling woman named Jane (Lil Dagover) and saying, “That’s my fiancée.” From there, the movie flashes back to tell Francis and Jane’s story.",
      "aspects": {
        "movie": {
          "words": [
            "film"
          ],
          "score": "1",
          "justification": "tantalizingly"
        },
        "plot": {
          "words": [
            "flashes back"
          ],
          "score": "0",
          "justification": ""
        }
      },
      "comment": ""
    },
    {
      "text": "But the flashback doesn’t start right away.",
      "aspects": {
        "plot": {
          "words": [
            "flashback"
          ],
          "score": "0",
          "justification": ""
        }
      },
      "comment": ""
    },
    {
      "text": "First, Wiene and cinematographer Willy Hameister iris in and out several times in succession, as Francis sets the scene for his bench-mate, talking about a mountain village and fateful carnival.",
      "aspects": {
        "plot": {
          "words": [
            "sets the scene"
          ],
          "score": "0",
          "justification": ""
        }
      },
      "comment": ""
    },
    {
      "text": "The halting intro has a mesmerizing effect—apt for a film about a hypnotist.",
      "aspects": {
        "movie": {
          "words": [
            "a film"
          ],
          "score": "1",
          "justification": "mesmerizing effect-apt"
        },
        "vision": {
          "words": [
            "mesmerizing"
          ],
          "score": "1",
          "justification": "mesmerizing effect-apt"
        }
      },
      "comment": "talks about vision, but no specific word to describe it. perhaps skip? charlie: mesmerizing can be a vision word"
    },
    {
      "text": "Francis’ flashback tells of a man named Dr. Caligari (Werner Krauss), with a curious carnival act: He travels with a sleepwalker named Cesare (Conrad Veidt), whom Caligari claims is under his spell, and can both predict the future and read minds.",
      "aspects": {
        "plot": {
          "words": [
            "flashback"
          ],
          "score": "0",
          "justification": ""
        }
      },
      "comment": "summarizing"
    },
    {
      "text": "When Cesare predicts that Francis’ friend Alan will die by dawn—and Alan does die, gruesomely—Francis and Jane do some snooping, to find out if Caligari and Cesare are connected to a string of local murders.",
      "aspects": {
      },
      "comment": "summarizing"
    },
    {
      "text": "But the closer they get to Caligari, the more they risk becoming another of his pawns, and the more they learn some unpleasant truths about the world they thought they knew.",
      "aspects": {
      },
      "comment": "summarizing"
    },
    {
      "text": "Kino Classics’ new Blu-ray edition of The Cabinet Of Dr. Caligari contains a stunning new 4K restoration, with a choice of two excellent musical scores: one a richly orchestrated soundtrack performed by musicians from Freiburg’s University Of Music, and the other a moody piece by DJ Spooky.",
      "aspects": {
        "sound": {
          "words": [
            "sound",
            "music",
            "soundtrack",
            "score",
            "orchestrated",
            "moody piece"
          ],
          "score": "2",
          "justification": "excellent, richly orchestrated"
        }
      },
      "comment": ""
    },
    {
      "text": "The cleaned-up picture of this new Caligari may be a revelation to anyone whose primary memories of the movie are of hazy, distorted old video transfers of battered prints.",
      "aspects": {
        "vision": {
          "words": [
            "hazy", "distorted"
          ],
          "score": "2",
          "justification": "revelation"
        }
      },
      "comment": ""
    },
    {
      "text": "In 4K, the level of detail in the painted backgrounds is clearer, and more impressive.",
      "aspects": {
        "vision": {
          "words": [
            "level of detail", "4K"
          ],
          "score": "1",
          "justification": "clearer, more impressive"
        }
      },
      "comment": "even though it's comparison of the same film in SD and 4k, it's still a positive note about vision imho"
    },
    {
      "text": "The Cabinet Of Dr. Caligari’s overtly unrealistic sets have the unexpected effect of making a nearly century-old film feel modern, because it so obviously isn’t a document of the past.",
      "aspects": {
        "movie": {
          "words": [
            "film"
          ],
          "score": "1",
          "justification": "modern"
        }
      },
      "comment": "charlie: this is a tough sentence"
    },
    {
      "text": "Caligari illustrates something more eternal: about great manipulators, and the underlying anxiety that either society has gone mad, or we have.",
      "aspects": {
        "concept": {
          "words": [
            "illustrates something"
          ],
          "score": "1",
          "justification": "more eternal, great, gone mad"
        }
      },
      "comment": "didn't know exactly how to annotate this. charlie: tricky one, made some suggestions"
    },
    {
      "text": "One of the big reasons The Cabinet Of Dr. Caligari still seems so vital is because artists and theoreticians haven’t stopped being influenced by it.",
      "aspects": {
        "movie": {
          "words": [
            "file-title"
          ],
          "score": "1",
          "justification": "vital"
        }
      },
      "comment": ""
    },
    {
      "text": "Critical studies like Siegfried Kracauer’s seminal film-studies book From Caligari To Hitler used Wiene’s movie and its contemporaries as a way to describe what happened in Europe and elsewhere in the 20th century.",
      "aspects": {
      },
      "comment": ""
    },
    {
      "text": "Horror films around the world—including Universal’s monster movies of the 1930s and 1940s—borrowed liberally from The Cabinet Of Dr. Caligari’s scenes of dark stalkers and desperate chases.",
      "aspects": {
      },
      "comment": ""
    },
    {
      "text": "And the crooked fingers of expressionism (in the design sense, if not the underlying philosophy) have touched even children’s books and cartoons, like the work of Dr. Seuss and Chuck Jones.",
      "aspects": {
      },
      "comment": ""
    },
    {
      "text": "But it’s The Cabinet Of Dr. Caligari’s depiction of a reality within a reality—explained by a story within a story—that’s pervaded popular culture in ways that haven’t gotten as much attention as the movie’s funky props.",
      "aspects": {
        "movie": {
          "words": [
            "file-title"
          ],
          "score": "1",
          "justification": "pervaded popular culture, funky"
        }
      },
      "comment": ""
    },
    {
      "text": "Wiene and screenwriters Hans Janowitz and Carl Mayer reveal the power of a well-constructed “this explains everything” tale to govern what people believe, and how they behave.",
      "aspects": {
        "plot": {
          "words": [
            "tale"
          ],
          "score": "1",
          "justification": "well-constructed"
        }
      },
      "comment": ""
    },
    {
      "text": "When the film’s villain walks down the street, flinching from the words “You must become Caligari” that literally appear in the air all around him, the visual effect is eye-catching.",
      "aspects": {
        "vision": {
          "words": [
            "visual"
          ],
          "score": "1",
          "justification": "eye-catching"
        },
        "plot": {
          "words": [
            "villian"
          ],
          "score": "0",
          "justification": ""
        }
      },
      "comment": "no sentiment attached to plot"
    },
    {
      "text": "But it’s also symbolic, showing how strong words can compel.  ",
      "aspects": {
      },
      "comment": ""
    }
  ],
  "overall": "2",
  "comment": "I don't even.. What is this?"
}
