{
  "title": "Maps to the Stars",
  "genres": "Drama",
  "source": "http://www.imdb.com/title/tt2172584/reviews?ref_=tt_ov_rt",
  "score": "8/10",
  "helpfulness": "33/47",
  "author": "Wojtek",
  "body": "I just returned from watching David Cronenberg's new movie 'Maps to the Stars' for the second time, this is my first review on here. The movie begins with the introduction of Agatha (Mia Wasikowska). The camera pans down the isle of a coach, there we see a sleeping girl, you can see on the t-shirt she is wearing with 'Bad Babysitter' printed on it. Agatha steps off the coach and has arrived in Hollywood, you can see she is disfigured by burns on her face, we assume that the not so subtle elbow-length gloves she wears throughout the movie are hiding her burns also. Agatha tells the limo driver Jerome (Rob Pattinson - in a small but important role) that she is here to help Carrie Fisher write a novel. She also tells Jerome she is visiting family but doesn't go in to details, she seems more interested in sight seeing and visiting celebrity homes such as the previous home of child star Benjie Weiss (Evan Bird), a foul mouthed 13 year old star of the 'Bad Babysitter' franchise. We also learn that Benjie is a recovering drug addict - typical Hollywood child stars aye? I suppose Bengie is rather sane compared to Havana Segrand played by Julianne Moore doing what she does best. Losing her mind! (One of her best roles to date in my opinion). Through mutual friend Carrie fisher, Agatha starts working for Havana as her PA. (or 'chore whore' as Havana bluntly calls it. Havana has issues (what Hollywood fading celebrity doesn't?) She is a fading actress who pops pharmaceutical pills daily; she desperately wants the main role in a remake of a movie her mother was in years ago when she was young and beautiful; At night, she see's her dead mother (Clarice Taggart who died in a fire in the 70's) played by Sarah Gadon. She also has major mommy issues, I won't go into too much detail, oh yeah, and she casually sits on the toilet and 'let's rip' while having a conversation with Agatha..She has no shame! Finally you Havana's unconventional therapist Dr Stafford and his wife Christina Weiss (John Cusack and Olivia Williams) the parents of Benjie. As the film progresses, the characters Cronenberg has introduced us to, slowly turn much darker and their connections go much further. The hyper reality Hollywood he has created is at times far fetched but at the same time so serious, I was intrigued and didn't want the experience to end. Julianne Moore gives it her all in this and I hope she gets some recognition for her performance at Cannes or next years Oscars. If you are planning on watching this for her, you will not be disappointed. ",
  "annotated_sentences": [
    {
      "text": "I just returned from watching David Cronenberg's new movie 'Maps to the Stars' for the second time, this is my first review on here.",
      "aspects": {
      },
      "comment": "ignore"
    },
    {
      "text": "The movie begins with the introduction of Agatha (Mia Wasikowska).",
      "aspects": {
      },
      "comment": "ignore"
    },
    {
      "text": "The camera pans down the isle of a coach, there we see a sleeping girl, you can see on the t-shirt she is wearing with 'Bad Babysitter' printed on it.",
      "aspects": {
      },
      "comment": "ignore"
    },
    {
      "text": "Agatha steps off the coach and has arrived in Hollywood, you can see she is disfigured by burns on her face, we assume that the not so subtle elbow-length gloves she wears throughout the movie are hiding her burns also.",
      "aspects": {
      },
      "comment": "ignore"
    },
    {
      "text": "Agatha tells the limo driver Jerome (Rob Pattinson - in a small but important role) that she is here to help Carrie Fisher write a novel.",
      "aspects": {
      },
      "comment": "ignore"
    },
    {
      "text": "She also tells Jerome she is visiting family but doesn't go in to details, she seems more interested in sight seeing and visiting celebrity homes such as the previous home of child star Benjie Weiss (Evan Bird), a foul mouthed 13 year old star of the 'Bad Babysitter' franchise.",
      "aspects": {
      },
      "comment": "ignore"
    },
    {
      "text": "We also learn that Benjie is a recovering drug addict - typical Hollywood child stars aye?",
      "aspects": {
      },
      "comment": "ignore"
    },
    {
      "text": "I suppose Bengie is rather sane compared to Havana Segrand played by Julianne Moore doing what she does best.",
      "aspects": {
      },
      "comment": "ignore, though acting referred to"
    },
    {
      "text": "Losing her mind!",
      "aspects": {
      },
      "comment": "ignore"
    },
    {
      "text": "(One of her best roles to date in my opinion).",
      "aspects": {
      },
      "comment": "again - playing referred to"
    },
    {
      "text": "Through mutual friend Carrie fisher, Agatha starts working for Havana as her PA. (or 'chore whore' as Havana bluntly calls it.",
      "aspects": {
      },
      "comment": "ignore"
    },
    {
      "text": "Havana has issues (what Hollywood fading celebrity doesn't?",
      "aspects": {
      },
      "comment": "ignore"
    },
    {
      "text": ") She is a fading actress who pops pharmaceutical pills daily; she desperately wants the main role in a remake of a movie her mother was in years ago when she was young and beautiful; At night, she see's her dead mother (Clarice Taggart who died in a fire in the 70's) played by Sarah Gadon.",
      "aspects": {
      },
      "comment": "ignore"
    },
    {
      "text": "She also has major mommy issues, I won't go into too much detail, oh yeah, and she casually sits on the toilet and 'let's rip' while having a conversation with Agatha..She has no shame!",
      "aspects": {
      },
      "comment": "ignore"
    },
    {
      "text": "Finally you Havana's unconventional therapist Dr Stafford and his wife Christina Weiss (John Cusack and Olivia Williams) the parents of Benjie.",
      "aspects": {
      },
      "comment": "ignore"
    },
    {
      "text": "As the film progresses, the characters Cronenberg has introduced us to, slowly turn much darker and their connections go much further.",
      "aspects": {
      },
      "comment": "ignore"
    },
    {
      "text": "The hyper reality Hollywood he has created is at times far fetched but at the same time so serious, I was intrigued and didn't want the experience to end. Julianne Moore gives it her all in this and I hope she gets some recognition for her performance at Cannes or next years Oscars.",
      "aspects": {
        "credibility": {
          "words": [
            "hyper reality"
          ],
          "score": "-1",
          "justification": "far fetched"
        }
      },
      "comment": "should we include misspellings as well (missing hyphen)?"
    },
    {
      "text": "If you are planning on watching this for her, you will not be disappointed. ",
      "aspects": {
      },
      "comment": "we should seriously consider including disappointed as a separate module - it is ssssssssoooooooooo often in those crappy reviews!"
    }
  ],
  "overall": "1",
  "comment": "a bit too much bullcrap (plot paraphrase etc.)"
}