{
  "title": "'71",
  "genres": "Drama",
  "source": "http://www.imdb.com/title/tt2614684/reviews?ref_=tt_ov_rt",
  "score": "9/10",
  "helpfulness": "25/31",
  "author": "Wojtek",
  "body": "Set against the complex backdrop of the beginnings of Northern Ireland in 71 but before Bloody Sunday really turned the tide in the favour of the IRA in 72 this is an extremely well made taught piece of drama. With an assured performance by rising star Jack O'Connell in the lead, he plays a young soldier Gary Hook recently deployed to Northern Ireland who finds himself out of his dept when going on his first patrol thanks to the incompetence of his CO (Sam Reid) - Separated from his unit and lost in a city he doesn't know he's forced in a fight for survival as its hard to tell who is friend and who is foe in this extremely well written piece of drama. The writer here has taken care not to paint one side entirely good or bad and that is how it was. Wounded and armed with nothing but a knife Hook has enemies closing in from all sides as the film draws to a bloody climax. I don't want to be accused of gushing praise, but there is much to compliment the whole team involved here, from the tones of the production design, beautifully capturing the mood feel and look of the 1970's in drab pastels and the grey of urban decay. The editing, directing, lighting is all bang on the money but greatest of all is the casting, for it is not only O'Connell who shines here, but the younger members of the cast almost upstage him with their brilliant performances. Two stand outs of the younger cast were Corey McKinley (Listed rather almost like an extra on here as 'Loyalist Child which seems a little unfair) and Barry Keoghan - The former is clearly a star in the making with his ballsy performance while Keoghan with almost no lines makes an amazing impact with simple looks conveying the struggles of emotion he feels inside when it comes to committing to a path of violence. Veterans Sean Harris brings his creepy presence to the duplicitous under cover unit commander but it is an energetic performance by O'Connell that brings it all together. Let us hope we do not loose him to Hollywood entirely. The film also takes time to give Hooks character some context, so we have some idea of his own life and attachments back home. A man almost without a family but not without people who are depending on him, this is a true depicting for many whom join the army, an alternative to spending life on the dole. This film is living proof that we can make thrilling and exciting cinema in the UK but still leave some room for Social Commentary within the context of a great story - an excellent thriller which hints at the dark path that was to follow in Northern Ireland for many years. Strongly recommended. ",
  "annotated_sentences": [
    {
      "text": "Set against the complex backdrop of the beginnings of Northern Ireland in 71 but before Bloody Sunday really turned the tide in the favour of the IRA in 72 this is an extremely well made taught piece of drama.",
      "aspects": {
        "movie": {
          "words": [
            "this"
          ],
          "score": "2",
          "justification": "extremely well made"
        }
      },
      "comment": ""
    },
    {
      "text": "With an assured performance by rising star Jack O'Connell in the lead, he plays a young soldier Gary Hook recently deployed to Northern Ireland who finds himself out of his dept when going on his first patrol thanks to the incompetence of his CO (Sam Reid) - Separated from his unit and lost in a city he doesn't know he's forced in a fight for survival as its hard to tell who is friend and who is foe in this extremely well written piece of drama.",
      "aspects": {
        "movie": {
          "words": [
            "this"
          ],
          "score": "2",
          "justification": "extremely well written"
        },
        "cast": {
          "words": [
            "plays a",
            "performance"
          ],
          "score": "2",
          "justification": "assured"
        }
      },
      "comment": "yeah, make your sentences even longer, bitch"
    },
    {
      "text": "The writer here has taken care not to paint one side entirely good or bad and that is how it was.",
      "aspects": {
      },
      "comment": "ignore"
    },
    {
      "text": "Wounded and armed with nothing but a knife Hook has enemies closing in from all sides as the film draws to a bloody climax.",
      "aspects": {
      },
      "comment": "ignore"
    },
    {
      "text": "I don't want to be accused of gushing praise, but there is much to compliment the whole team involved here, from the tones of the production design, beautifully capturing the mood feel and look of the 1970's in drab pastels and the grey of urban decay.",
      "aspects": {
        "cinematography": {
          "words": [
            "production"
          ],
          "score": "1",
          "justification": "compliment"
        },
        "credibility": {
          "words": [
            "capturing"
          ],
          "score": "2",
          "justification": "beautifully"
        },
        "vision": {
          "words": [
            "design"
          ],
          "score": "2",
          "justification": "beautifully"
        }
      },
      "comment": "not sure if this is the best way to do it, Woj: maybe it looks better now?"
    },
    {
      "text": "The editing, directing, lighting is all bang on the money but greatest of all is the casting, for it is not only O'Connell who shines here, but the younger members of the cast almost upstage him with their brilliant performances.",
      "aspects": {
        "editing": {
          "words": [
            "editing"
          ],
          "score": "2",
          "justification": "bang on the money"
        },
        "cast": {
          "words": [
            "cast",
            "performance"
          ],
          "score": "2",
          "justification": "greatest of all"
        },
        "vision": {
          "words": [
            "lighting"
          ],
          "score": "2",
          "justification": "bang on the money"
        }
      },
      "comment": "add bang on the money :)"
    },
    {
      "text": "Two stand outs of the younger cast were Corey McKinley (Listed rather almost like an extra on here as 'Loyalist Child which seems a little unfair) and Barry Keoghan - The former is clearly a star in the making with his ballsy performance while Keoghan with almost no lines makes an amazing impact with simple looks conveying the struggles of emotion he feels inside when it comes to committing to a path of violence.",
      "aspects": {
        "cast": {
          "words": [
            "cast",
            "performance"
          ],
          "score": "1",
          "justification": "ballsy"
        }
      },
      "comment": "add ballsy?"
    },
    {
      "text": "Veterans Sean Harris brings his creepy presence to the duplicitous under cover unit commander but it is an energetic performance by O'Connell that brings it all together.",
      "aspects": {
        "cast": {
          "words": [
            "performance"
          ],
          "score": "1",
          "justification": "energetic"
        }
      },
      "comment": "good or just neutral?"
    },
    {
      "text": "Let us hope we do not loose him to Hollywood entirely.",
      "aspects": {
      },
      "comment": "ignore"
    },
    {
      "text": "The film also takes time to give Hooks character some context, so we have some idea of his own life and attachments back home.",
      "aspects": {
        "plot": {
          "words": [
            "character"
          ],
          "score": "1",
          "justification": "takes time"
        }
      },
      "comment": "ignore"
    },
    {
      "text": "A man almost without a family but not without people who are depending on him, this is a true depicting for many whom join the army, an alternative to spending life on the dole.",
      "aspects": {
        "credibility": {
          "words": [
            "true"
          ],
          "score": "1",
          "justification": "true depiciting"
        }
      },
      "comment": "I don't think we are detecting this aspect correctly"
    },
    {
      "text": "This film is living proof that we can make thrilling and exciting cinema in the UK but still leave some room for Social Commentary within the context of a great story - an excellent thriller which hints at the dark path that was to follow in Northern Ireland for many years.",
      "aspects": {
        "plot": {
          "words": [
            "thriller"
          ],
          "score": "2",
          "justification": "excellent"
        },
        "movie": {
          "words": [
            "cinema"
          ],
          "score": "2",
          "justification": "thrilling, exciting"
        }
      },
      "comment": "not sure if this is right, Woj: is it better now? add thriller as story? charlie: as plot"
    },
    {
      "text": "Strongly recommended. ",
      "aspects": {
        "movie": {
          "words": [
            "nothing suggests it!"
          ],
          "score": "2",
          "justification": "Strongly recommended"
        }
      },
      "comment": "add recommended to dic"
    }
  ],
  "overall": "2",
  "comment": "See last sentence - no way to anchor sentiment - many difficult sentences. second marker Woj lol"
}
