{
  "title": "Goodfellas",
  "genres": "Crime, Drama",
  "source": "http://www.imdb.com/title/tt0099685/reviews?ref_=tt_urv",
  "score": "10/10",
  "helpfulness": "239/331",
  "author": "Dylan Hanning",
  "body": "Amazing is the one and only word to say for this film. I have always thought that Goodfellas was one of the greatest films ever made and set a landmark in the 90's or even in movie history. I bought Goodfellas last week and I got to watch the film a couple days ago. I really just couldn't lay my eyes off the film and everything about it was just simply worth watching. The acting was excellent, Ray Liotta, Robert DeNiro, Joe Pesci, Lorraine Bracco, and other actors did great and almost all of the characters they portrayed were 100% accurate. The camera-work also was brilliant and Martin Scorsese does a beautiful job by putting excellent camera shots in his films and I give him high credit for that. The soundtrack too is one of the best soundtracks ever made and the song \"Layla,\" put chills down my spine of how great this song fitted the film. Overall, Martin Scorsese made his best film in my opinion and him and Nicholas Pileggi made an excellent and sharp script that made this, the greatest mob film still today.Hedeen's Outlook: 10/10!! **** A+",
  "annotated_sentences": [
    {
      "text": "Amazing is the one and only word to say for this film.",
      "aspects": {
        "movie": {
          "words": [
            "film"
          ],
          "score": "2",
          "justification": "Amazing"
        }
      },
      "comment": ""
    },
    {
      "text": "I have always thought that Goodfellas was one of the greatest films ever made and set a landmark in the 90's or even in movie history.",
      "aspects": {
        "movie": {
          "words": [
            "films"
          ],
          "score": "2",
          "justification": "one of the greatest"
        }
      },
      "comment": "Woj: landmark might not be the best choice here, to actually be added to sentlist tbh"
    },
    {
      "text": "I bought Goodfellas last week and I got to watch the film a couple days ago. I really just couldn't lay my eyes off the film and everything about it was just simply worth watching.",
      "aspects": {
        "movie": {
          "words": [
            "film"
          ],
          "score": "2",
          "justification": "I really couldn't lay my eyes off the film"
        }
      },
      "comment": "Woj: add to sent: n't lay my eyes off"
    },
    {
      "text": "The acting was excellent, Ray Liotta, Robert DeNiro, Joe Pesci, Lorraine Bracco, and other actors did great and almost all of the characters they portrayed were 100% accurate.",
      "aspects": {
        "credibility": {
          "words": [
            "accurate"
          ],
          "score": "1",
          "justification": "accurate"
        },
        "plot": {
          "words": [
            "characters"
          ],
          "score": "1",
          "justification": "accurate, 100%"
        },
        "cast": {
          "words": [
            "acting"
          ],
          "score": "2",
          "justification": "excellent"
        }
      },
      "comment": ""
    },
    {
      "text": "The camera-work also was brilliant and Martin Scorsese does a beautiful job by putting excellent camera shots in his films and I give him high credit for that.",
      "aspects": {
        "cinematography": {
          "words": [
            "camera-work"
          ],
          "score": "2",
          "justification": "excellent, beautiful"
        }
      },
      "comment": "Woj: fine with focusing on camera shots, but also camera-work - add to list?"
    },
    {
      "text": "The soundtrack too is one of the best soundtracks ever made and the song \"Layla,\" put chills down my spine of how great this song fitted the film.",
      "aspects": {
        "sound": {
          "words": [
            "sound"
          ],
          "score": "2",
          "justification": "best soundtracks ever made"
        }
      },
      "comment": "Wojt: add best x ever multiple entries to all aspects?"
    },
    {
      "text": "Overall, Martin Scorsese made his best film in my opinion and him and Nicholas Pileggi made an excellent and sharp script that made this, the greatest mob film still today.Hedeen's Outlook: 10/10!!",
      "aspects": {
        "movie": {
          "words": [
            "film"
          ],
          "score": "2",
          "justification": "excellent best"
        },
        "dialog": {
          "words": [
            "script"
          ],
          "score": "2",
          "justification": "sharp"
        }
      },
      "comment": ""
    },
    {
      "text": "**** A+",
      "aspects": {
      },
      "comment": ""
    }
  ],
  "overall": "2",
  "comment": ""
}
